[{"location":"dev room","NpcName":"danny"},{"location":"party floor","initialDialogue":"\n%s, it looks like you were supposed to bring a cake to the potluck!  No cake, no service. Life is but a series of exchanges. A back and forth. An end with no beginning. An endless abyss. And in that abyss, we only ask for cake to ease the pain...\n","dialogueNoItem":"\nI still need that cake. We\u0027re not doing anything without it! And please, no hair on it this time. You\u0027d think you were a werewolf with the chili you brought last time!\n\nNow, that you\u0027re here we need to have a talk. You\u0027ve had 13 complaints from MULTIPLE people in this office.  You are not only a disgrace as an employee, but as a person in general. You\u0027re inconsiderate, oblivious, and you smell. You make me sick %s.\n","dialogueWithItem":"\nFINALLY! About time you brought that sweet goodness down here. By the way, they changed the pin code to your desk today. Here\u0027s the new code. Try not to be pathetic anymore.\n","itemsDropped":"code","NpcName":"brenda","dialogueQuestDone":"\nThanks for the bringing the cake again, I only meant a little bit of what I said earlier, these parties can be stressful to organize sometimes. Have a nice rest of your day!\n","prereq":"cake","interactionCount":0},{"location":"break room","initialDialogue":"\nHowdy, %s! Ooohweee! I\u0027m struggling today, I forgot to eat breakfast this morning and I have been moving slow all day. I\u0027m waiting on that candy bar you owe me. But, you know what they say, a crocodile don\u0027t make no how with the kitchen mop.\n","dialogueNoItem":"\nI am starting to believe what they\u0027ve been saying about you, %s.  I\u0027m sitting here hungry for a candy bar and you aint worth the last thread in a wet sock.  You know the difference between an apple and a car?  Grit...\n","dialogueWithItem":"\n%s I\u0027ll tell you what! It\u0027s not about the destination. It\u0027s about the journey. That\u0027s the best snack I\u0027ve had since Momma gave me arthritis. Speaking of, do you mind doing me a favor?  Them fellas up on Dev floor left their key fob for that back room in here. You mind dropping it off for me?\n","itemsDropped":"keyfob","NpcName":"roy","dialogueQuestDone":"\nGo away youngin... I\u0027m busy and have no more business with you!\n","prereq":"raisinets","interactionCount":0}]